FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_MCI.c
/*-------------------------------------------------------------------------*
 * File:  LPC17xx_40xx_MCI.c
 *-------------------------------------------------------------------------*
 * Description:
 *     
 *-------------------------------------------------------------------------*/
 
/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZ License.pdf or visit http://goo.gl/UDtTCR for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(r) to your own hardware!  |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------*
 * Includes:
 *-------------------------------------------------------------------------*/
#include <string.h>
#include <uEZ.h>
#include <uEZProcessor.h>
#include <uEZMemory.h>
#include <uEZPlatformAPI.h>
#include <HAL/Interrupt.h>
#include <HAL/GPDMA.h>
#include "LPC17xx_40xx_MCI.h"
#include "LPC17xx_40xx_GPIO.h"
#include <Source/Library/SEGGER/RTT/SEGGER_RTT.h>

/*-------------------------------------------------------------------------*
 * Constants:
 *-------------------------------------------------------------------------*/
#if ((COMPILER_TYPE==RowleyARM) || (COMPILER_TYPE==Keil4))
    #define MCI_MEMORY __attribute__((section(".mcimem")));
#elif (COMPILER_TYPE==IAR)
    #define MCI_MEMORY @ ".mcimem"
#else
    #define MCI_MEMORY // no mods
#endif

#ifndef NUM_MAX_BLOCKS
/* Block transfer FIFO depth (>= 2), 20+ recommended */
#if (UEZ_PROCESSOR==NXP_LPC1788)
#define NUM_MAX_BLOCKS  16 // Set a new permanent setting on this LPC to ensure enough size for USB/Eth and correct placement on AHB
#elif (UEZ_PROCESSOR==NXP_LPC4088)
#define NUM_MAX_BLOCKS  16 // Set a new permanent setting on this LPC to ensure enough size for USB/Eth and correct placement on AHB
#else
#define NUM_MAX_BLOCKS  32 // ideal size
#endif
#endif

#ifndef SDCARD_MCI_RATE_FOR_RW_STATE
    #define SDCARD_MCI_RATE_FOR_RW_STATE       25000000UL // 18000000UL // 18 MHz  // TODO: Need to remove!
#endif

// Easy remap of registers:
#define MCI_POWER       LPC_MCI->POWER      // requires AHB delay
#define MCI_CLOCK       LPC_MCI->CLOCK      // requires AHB delay
#define MCI_ARGUMENT    LPC_MCI->ARGUMENT   // requires AHB delay
#define MCI_COMMAND     LPC_MCI->COMMAND
#define MCI_CLEAR       LPC_MCI->CLEAR
#define MCI_STATUS      LPC_MCI->STATUS
#define MCI_RESP0       LPC_MCI->RESP0
#define MCI_RESP1       LPC_MCI->RESP1
#define MCI_RESP2       LPC_MCI->RESP2
#define MCI_RESP3       LPC_MCI->RESP3
#define MCI_MASK0       LPC_MCI->MASK0
#define MCI_DATA_CTRL   LPC_MCI->DATACTRL   // requires AHB delay
#define MCI_DATA_LEN    LPC_MCI->DATALEN
#define MCI_DATA_TMR    LPC_MCI->DATATMR
#define MCI_FIFO        LPC_MCI->FIFO

/* MCIStatus register bits: */
#define MCI_STATUS_CMD_CRC_FAIL         (1<<0)
#define MCI_STATUS_DATA_CRC_FAIL        (1<<1)
#define MCI_STATUS_CMD_TIME_OUT         (1<<2)
#define MCI_STATUS_DATA_TIME_OUT        (1<<3)
#define MCI_STATUS_TX_UNDERRUN          (1<<4)
#define MCI_STATUS_RX_OVERRUN           (1<<5)
#define MCI_STATUS_CMD_RESP_END         (1<<6)
#define MCI_STATUS_CMD_CMD_SENT         (1<<7)
#define MCI_STATUS_DATA_END             (1<<8)
#define MCI_STATUS_START_BIT_ERR        (1<<9)
#define MCI_STATUS_DATA_BLOCK_END       (1<<10)
#define MCI_STATUS_CMD_ACTIVE           (1<<11)
#define MCI_STATUS_TX_ACTIVE            (1<<12)
#define MCI_STATUS_RX_ACTIVE            (1<<13)
#define MCI_STATUS_TX_FIFO_HALF_EMPTY   (1<<14)
#define MCI_STATUS_RX_FIFO_HALF_FULL    (1<<15)
#define MCI_STATUS_TX_FIFO_FULL         (1<<16)
#define MCI_STATUS_RX_FIFO_FULL         (1<<17)
#define MCI_STATUS_TX_FIFO_EMPTY        (1<<18)
#define MCI_STATUS_RX_FIFO_EMPTY        (1<<19)
#define MCI_STATUS_TX_DATA_AVAIL        (1<<20)
#define MCI_STATUS_RX_DATA_AVAIL        (1<<21)

#define MCI_STATUS_ERRORS \
    (MCI_STATUS_DATA_CRC_FAIL|MCI_STATUS_DATA_TIME_OUT|MCI_STATUS_RX_OVERRUN| \
        MCI_STATUS_TX_UNDERRUN | MCI_STATUS_DATA_END|MCI_STATUS_START_BIT_ERR| \
            MCI_STATUS_DATA_BLOCK_END)
      
/*#define MCI_STATUS_ERRORS \
    (MCI_STATUS_CMD_CRC_FAIL|MCI_STATUS_CMD_TIME_OUT| \
      MCI_STATUS_DATA_CRC_FAIL|MCI_STATUS_DATA_TIME_OUT|MCI_STATUS_RX_OVERRUN| \
        MCI_STATUS_TX_UNDERRUN | MCI_STATUS_DATA_END|MCI_STATUS_START_BIT_ERR| \
            MCI_STATUS_DATA_BLOCK_END)*/

/*-------------------------------------------------------------------------*
 * Types:
 *-------------------------------------------------------------------------*/
typedef struct {
    const HAL_MCI *iHAL;

    T_uezGPIOPortPin iCardDetect;
    T_uezGPIOPortPin iWriteProtect;

    T_mciReceptionComplete iReceptionCompleteCallback;
    void *iReceptionCompleteCallbackWorkspace;

    T_mciTransmissionComplete iTransmissionCompleteCallback;
    void *iTransmissionCompleteCallbackWorkspace;

    T_mciError iErrorCallback;
    void *iErrorCallbackWorkspace;
    
    TUInt32 iRCA;       // Relative Card Address

    HAL_GPDMA **iGPDMA;
    TBool iIRQActive;

    // Position in buffer array to receive data
    TUInt8 iBufferPosIn;

    // Position in buffer to take data out of
    TUInt8 iBufferPosOut;

    // Number we are writing
    TUInt8 iNumWriting;

    // Status of current transfer
    TUInt8 iTransferStatus;

    TUInt32 iLastMCIError;
} T_LPC17xx_40xx_MCI_Workspace;

#define TRANSFER_STATUS_READING             0x01
#define TRANSFER_STATUS_WRITING             0x02
#define TRANSFER_STATUS_BUFFER_OVERRUN      0x04
#define TRANSFER_STATUS_MCI_ERROR           0x08
#define TRANSFER_STATUS_DONE                0x10
#define TRANSFER_STATUS_ANY_ERROR   \
    (TRANSFER_STATUS_BUFFER_OVERRUN|TRANSFER_STATUS_MCI_ERROR)

