FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_MCI.c
/*-------------------------------------------------------------------------*
 * Globals:
 *-------------------------------------------------------------------------*/



/* Block transfer FIFO -- MUST be placed in AHB memory */
UEZ_ALIGN_VAR(32,static TUInt32 G_dmaBlocks[NUM_MAX_BLOCKS][128] MCI_MEMORY);
/* DMA link lists -- MUST be placed in AHB memory */
UEZ_ALIGN_VAR(32,static TUInt32 G_linkListRead[NUM_MAX_BLOCKS][4] MCI_MEMORY);
UEZ_ALIGN_VAR(32,static TUInt32 G_linkListWrite[NUM_MAX_BLOCKS][4] MCI_MEMORY);
T_LPC17xx_40xx_MCI_Workspace *G_mciWorkspace;

#define Copy_al2un memcpy // This is ok if our buffers above and application buffer are 32 aligned.

/*-------------------------------------------------------------------------*
 * Prototypes:
 *-------------------------------------------------------------------------*/
void LPC17xx_40xx_MCI_ProcessInterrupt(T_LPC17xx_40xx_MCI_Workspace *p);

/* Note: After a data write, data cannot be written to this register for three
 * MCLK clock periods plus two PCLK clock periods. Applies to these registers:
 * LPC_MCI->POWER LPC_MCI->CLOCK LPC_MCI->ARGUMENT LPC_MCI->DATACTRL
*/
UEZ_FUNC_OPT(UEZ_OPT_LEVEL_NONE,static void writeDelay(void))
{
	volatile uint8_t i;
	for ( i = 0; i < 0x10; i++ ) {	/* delay 3MCLK + 2PCLK  */
	}
}

/*---------------------------------------------------------------------------*
 * Interrupt:  LPC17xx_40xx_MCI_Interrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      A MCI Interrupt has come in.  Process the one workspace attached
 *      to this interrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(LPC17xx_40xx_MCI_Interrupt)
{
    IRQ_START();
    LPC17xx_40xx_MCI_ProcessInterrupt(G_mciWorkspace);
    IRQ_END();
}



/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_MCI_ProcessInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Process an interrupt for this workspace
 * Inputs:
 *      void *aWorkspace          -- MCI Workspace
 * Outputs:
 *      void
 *---------------------------------------------------------------------------*/
void LPC17xx_40xx_MCI_ProcessInterrupt(
    T_LPC17xx_40xx_MCI_Workspace *p)
{
    TUInt32 ms;
    TUInt8 xs;
    //TUInt32 n;
    //T_gpdmaRequest r;

    /* Clear MCI interrupt status */
    ms = MCI_STATUS & MCI_STATUS_ERRORS;
    MCI_CLEAR = ms;

    xs = p->iTransferStatus;

    if ((ms & MCI_STATUS_TX_UNDERRUN) == MCI_STATUS_TX_UNDERRUN) {
      p->iLastMCIError = ms;
      if (p->iErrorCallback) {
         p->iErrorCallback(p->iErrorCallbackWorkspace);
      }
    }
    if ((ms & MCI_STATUS_RX_OVERRUN) == MCI_STATUS_RX_OVERRUN) {
      p->iLastMCIError = ms;
      if (p->iErrorCallback) {
         p->iErrorCallback(p->iErrorCallbackWorkspace);
      }
    }
    
    if ((ms & MCI_STATUS_DATA_BLOCK_END) == MCI_STATUS_DATA_BLOCK_END) {
        /* A block transfer completed (DataBlockEnd) */
        if (xs & TRANSFER_STATUS_READING) {
            /* In card read operation */
            if ((ms & MCI_STATUS_DATA_END) == MCI_STATUS_DATA_END) {
                /* When last block is received (DataEnd), */
                /* Pop off remaining data in the MCIFIFO */
                (*(p->iGPDMA))->BurstRequest(p->iGPDMA,
                    GPDMA_PERIPHERAL_SD_MMC);
            }
            /* Track where the next position is at */
            p->iBufferPosIn++;

            if (p->iReceptionCompleteCallback)
                p->iReceptionCompleteCallback(
                    p->iReceptionCompleteCallbackWorkspace);
        } else {
            /* In card write operation */
            /* Next write buffer */
            p->iBufferPosOut++;
            /* Are we done yet? */
            if (p->iBufferPosOut >= p->iNumWriting) {
                xs |= TRANSFER_STATUS_DONE;
                // Notify that we are complete
                if (p->iTransmissionCompleteCallback)
                    p->iTransmissionCompleteCallback(
                        p->iTransmissionCompleteCallbackWorkspace);
            }
        }
    } else {
        if ((ms & MCI_STATUS_CMD_RESP_END) == MCI_STATUS_CMD_RESP_END) {
          
        } else {
			          
            /* An MCI error occured (not DataBlockEnd) */
            xs |= TRANSFER_STATUS_MCI_ERROR;

            // Record the error
            p->iLastMCIError = ms;
            // Keep these so that we don't have to wait on timeout even when there is an error.
            if (p->iTransferStatus & TRANSFER_STATUS_READING) {
                // Error during reading
                if (p->iReceptionCompleteCallback)
                    p->iReceptionCompleteCallback(
                        p->iReceptionCompleteCallbackWorkspace);
            } else {
                // Error in writing
                if (p->iTransmissionCompleteCallback)
                    p->iTransmissionCompleteCallback(
                        p->iTransmissionCompleteCallbackWorkspace);
            }
        }
    }

    p->iTransferStatus = xs;

}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_MCI_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the workspace for this LCD Controller
 * Inputs:
 *      void *aWorkspace          -- Memory allocated for workspace area.
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_MCI_InitializeWorkspace(void *aWorkspace)
{
    TUInt32 n;
    TUInt32 dma_control;
    T_LPC17xx_40xx_MCI_Workspace *p = (T_LPC17xx_40xx_MCI_Workspace *)aWorkspace;
    p->iHAL = &LPC17xx_40xx_MCI_Interface;

    p->iCardDetect = GPIO_NONE;
    p->iWriteProtect = GPIO_NONE;
    p->iReceptionCompleteCallback = 0;
    p->iReceptionCompleteCallbackWorkspace = 0;
    p->iRCA = 0;
    p->iGPDMA = 0; // DMA channel prio is fixed. DMA0=highest prio, DMA7=lowest prio.
    p->iIRQActive = EFalse;

    // Setup the GPDMA channel for reads
    dma_control = /*GPDMA_INT_ENABLE | */GPDMA_DI | GPDMA_DBWIDTH_32
        | GPDMA_SBWIDTH_32 | GPDMA_SBSIZE_8 | GPDMA_DBSIZE_8
        | GPDMA_TRANSFER_SIZE(512 / 4);

    /* Create link list */
    // Each link in the link list to copy from MCI_FIFO into a block
    // of memory in G_dmaBlocks.  The links to each other allow the whole
    // list of G_dmaBlocks blocks allow the complete dma buffers to be called.
    for (n = 0; n < NUM_MAX_BLOCKS; n++) {
        // MCI_FIFO -> G_dmaBlocks[n]
        G_linkListRead[n][0] = (TUInt32)&MCI_FIFO;
        G_linkListRead[n][1] = (TUInt32)G_dmaBlocks[n];
        G_linkListRead[n][2] = ((n+1)>=NUM_MAX_BLOCKS)?0:(TUInt32)G_linkListRead[n + 1];
        G_linkListRead[n][3] = dma_control;
    }

