FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_MCI.c
    // Setup the GPDMA channel for writes
    dma_control = /*GPDMA_INT_ENABLE | */GPDMA_SI | GPDMA_DBWIDTH_32
        | GPDMA_SBWIDTH_32 | GPDMA_SBSIZE_8 | GPDMA_DBSIZE_8
        | GPDMA_TRANSFER_SIZE(512 / 4);

    /* Create link list */
    // Each link in the link list to copy from MCI_FIFO into a block
    // of memory in G_dmaBlocks.  The links to each other allow the whole
    // list of G_dmaBlocks blocks allow the complete dma buffers to be called.
    for (n = 0; n < NUM_MAX_BLOCKS; n++) {
        // G_dmaBlocks[n] -> MCI_FIFO
        G_linkListWrite[n][0] = (TUInt32)G_dmaBlocks[n];
        G_linkListWrite[n][1] = (TUInt32)&MCI_FIFO;
        G_linkListWrite[n][2] = ((n+1)>=NUM_MAX_BLOCKS)?0:(TUInt32)G_linkListWrite[n + 1];
        G_linkListWrite[n][3] = dma_control;
    }

    G_mciWorkspace = p;



    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_MCI_PowerOn
 *---------------------------------------------------------------------------*
 * Description:
 *      Have the MCI power on the target
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_MCI_PowerOn(void *aWorkspace)
{
    // Turn on the power (if not already on), wait 10 ms minimum,
    // and then enable the signals
    LPC_MCI->POWER = 0x01;
    writeDelay();
    UEZTaskDelay(10);
    LPC_MCI->POWER = 0x03;
    writeDelay();

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_MCI_PowerOff
 *---------------------------------------------------------------------------*
 * Description:
 *      Have the MCI power off the target
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_MCI_PowerOff(void *aWorkspace)
{
    MCI_MASK0 = 0;
    MCI_COMMAND = 0;
    MCI_DATA_CTRL = 0;
    writeDelay();

    MCI_POWER = 0; /* Power-off */
    writeDelay();
    MCI_CLOCK = 0;
    writeDelay();

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_MCI_Reset
 *---------------------------------------------------------------------------*
 * Description:
 *      Reset the MCI Controller
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_MCI_Reset(void *aWorkspace)
{
    // Reset MCI Registers
    LPC_MCI->MASK0 = 0;
    LPC_MCI->COMMAND = 0;
    LPC_MCI->DATACTRL = 0;
    writeDelay();

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_MCI_SendCommand
 *---------------------------------------------------------------------------*
 * Description:
 *      Send the MCI Controller a standard command.  Commands are of the
 *      type MCI_CMDx or MCI_ACMDx.  Some commands require an argument.
 *      Depending on the command, a type of response (none, short, or long)
 *      may be returned in the passed aResponse.
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 *      TUInt16 aCommand        -- Command number, MCI_ACMD for ACMD's.
 *      TUInt32 aArgument       -- Argument for command
 *      T_uezMCIResponseType aResponseType -- Response type to get back
 *      TUInt32 *aResponse      -- Place to store the response.
 * Outputs:
 *      TBool                   -- ETrue if successful, else EFalse.
 *---------------------------------------------------------------------------*/
TBool LPC17xx_40xx_MCI_SendCommand(
    void *aWorkspace,
    TUInt16 aCommand,
    TUInt32 aArgument,
    T_uezMCIResponseType aResponseType,
    TUInt32 *aResponse)
{
    TUInt32 status, command;
    TUInt32 startTimeout;
    T_LPC17xx_40xx_MCI_Workspace *p = (T_LPC17xx_40xx_MCI_Workspace *)aWorkspace;

    /* Send a MCI_CMD55 prior to the specified command if it is MCI_ACMD class */
    if (aCommand & 0x80) {
        /* If MCI_CMD55 is fails, exit with error */
        if (!LPC17xx_40xx_MCI_SendCommand(aWorkspace, MCI_CMD55, (TUInt32)p->iRCA << 16UL,
            UEZ_MCI_RESPONSE_TYPE_SHORT, aResponse) || !(aResponse[0] & 0x00000020))
            return EFalse;
    }
    aCommand &= 0x3F; /* Mask out MCI_ACMD flag */

    do { /* Wait while CmdActive bit is set */
        MCI_COMMAND = 0; /* Cancel to transmit command */
        MCI_CLEAR = 0x0C5; /* Clear status flags */
        for (status = 0; status < 10; status++)
            MCI_STATUS; /* Skip lock out time of command reg. */
    } while (MCI_STATUS & 0x00800);

    MCI_ARGUMENT = aArgument; /* Set the argument into argument register */
    writeDelay();
    command = 0x400 | aCommand; /* Enable bit + aCommand */
    if (aResponseType == 1)
        command |= 0x040; /* Set Response bit to reveice short resp */
    if (aResponseType > 1)
        command |= 0x0C0; /* Set Response and LongResp bit to receive long resp */
    MCI_COMMAND = command; /* Initiate command transaction */

    startTimeout = UEZTickCounterGet();
    for (;;) { /* Wait for end of the cmd/resp transaction */
        if (UEZTickCounterGetDelta(startTimeout) > 100)
            return EFalse;
        status = MCI_STATUS; /* Get the transaction status */
        if (aResponseType == UEZ_MCI_RESPONSE_TYPE_NONE) {
            /* No response */
            if (status & 0x080) {
                /* CmdSent */
                /* No response, so stop here */
                return ETrue;
            }
        } else {
            /* Short or long response */
            if (status & MCI_STATUS_CMD_RESP_END) {
                break;
            }
            if (status & MCI_STATUS_CMD_CRC_FAIL) {
                if (aCommand == 1 || aCommand == 12 || aCommand == 41) {
                    /* Ignore resp CRC error on MCI_CMD1/12/41 */
                    break;
                }
                return EFalse;
            }
            if (status & 0x004) {
                /* CmdTimeOut */
                return EFalse;
            }
        }
    }

    /* Got a short or long response */
    /* Read the response words */
    aResponse[0] = MCI_RESP0;
    if (aResponseType == UEZ_MCI_RESPONSE_TYPE_RESPONSE_LONG) {
        aResponse[1] = MCI_RESP1;
        aResponse[2] = MCI_RESP2;
        aResponse[3] = MCI_RESP3;
    }

