FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_MCI.c
    return ETrue; /* Return with success */
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_MCI_ReadyReception
 *---------------------------------------------------------------------------*
 * Description:
 *      Prepare the MCI Controller for receiving blocks of data of the
 *      given size (usually 512 bytes).  When each block is received, call
 *      the given callback routine.
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 *      TUInt32 aNumBlocks      -- Number of blocks to receive
 *      TUInt32 aBlockSize      -- Block size.  Should be multiple of 4 and
 *                                  a power of 2.  Currently only 512 supported.
 *      T_mciReceptionComplete aReceptionCallback - Callback routine when
 *                                  received block.
 *      void *aReceptionCallbackWorkspace -- Workspace for callback.
 *      TUInt32 aNumBlocksReady -- Number of blocks readied equal or or less
 *                                  than aNumBlocks.  Can be zero.
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_MCI_ReadyReception(
    void *aWorkspace,
    TUInt32 aNumBlocks,
    TUInt32 aBlockSize,
    T_mciReceptionComplete aReceptionCallback,
    void *aReceptionCallbackWorkspace,
    TUInt32 *aNumBlocksReady) // TODO: Comment this everywhere
{
    T_gpdmaRequest r;
    T_LPC17xx_40xx_MCI_Workspace *p = (T_LPC17xx_40xx_MCI_Workspace *)aWorkspace;

    // Limit the number of blocks allowed to the length of our buffer
    if (aNumBlocks > NUM_MAX_BLOCKS)
        aNumBlocks = NUM_MAX_BLOCKS;
    *aNumBlocksReady = aNumBlocks;

    p->iReceptionCompleteCallback = aReceptionCallback;
    p->iReceptionCompleteCallbackWorkspace = aReceptionCallbackWorkspace;

    /* --------- Setting up block indexes ---------- */
    /* Block FIFO R/W index */
    p->iBufferPosOut = 0;
    p->iBufferPosIn = 0;
    p->iTransferStatus = TRANSFER_STATUS_READING;

    /* --------- Setting up DMA request ---------- */
    // Setup the first request
    r.iControl = /*GPDMA_INT_ENABLE | */GPDMA_DI | GPDMA_DBWIDTH_32
        | GPDMA_SBWIDTH_32 | GPDMA_SBSIZE_8 | GPDMA_DBSIZE_8;
    r.iSourcePeripheral = GPDMA_PERIPHERAL_SD_MMC;
    r.iSourceAddr = G_linkListRead[0][0];
    r.iDestinationPeripheral = GPDMA_PERIPHERAL_MEMORY;
    r.iDestinationAddr = G_linkListRead[0][1];
    r.iLinkedList = (void *)G_linkListRead[0][2];
    r.iNumTransferItems = GPDMA_TRANSFER_SIZE(aBlockSize / 4);
    //r.iFlowControl = GPDMA_FLOW_CONTROL_SOURCE_PERIPHERAL; // Will cause read failure!
    r.iFlowControl = GPDMA_FLOW_CONTROL_DMA; // Receiver should always be flow controller!

    (*p->iGPDMA)->PrepareRequest(p->iGPDMA, &r, 0, 0);

    (*p->iGPDMA)->Start(p->iGPDMA);

    /* --------- Setting up MCI ---------- */
    // Set data length
    MCI_DATA_LEN = 512 * aNumBlocks;
    // Data timer: 0.2sec
//    MCI_DATA_TMR = (TUInt32)(SDCARD_MCI_RATE_FOR_RW_STATE * 0.2);
    MCI_DATA_TMR = (TUInt32)(SDCARD_MCI_RATE_FOR_RW_STATE * 2.0); // TODO do we need to increase this timeout?
    // Clear status flags for errors
    MCI_CLEAR = MCI_STATUS_ERRORS;
    MCI_MASK0 = MCI_STATUS_ERRORS;
//    for (n = 0; aBlockSize > 1; aBlockSize >>= 1, n += 0x10)
//        ;
    /* Start to receive data blocks */
    MCI_DATA_CTRL = (9<<4) /*n*/ | 0xB;
    writeDelay();

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_MCI_ReadyTransmission
 *---------------------------------------------------------------------------*
 * Description:
 *      Prepare for a number of write block transactions.
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 *      TUInt32 aNumBlocks      -- Number of total blocks to write
 *      TUInt32 aBlockSize      -- Size of each block (only 512 supported)
 *      T_mciReceptionComplete aTranmissionCallback -- Routine to call
 *                                  when complete from interrupt.
 *      void *aTransmissionCallbackWorkspace -- Workspace for callback.
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_MCI_ReadyTransmission(
    void *aWorkspace,
    TUInt32 aNumBlocks,
    TUInt32 aBlockSize,
    TUInt32 *aNumWriting)
{
    T_LPC17xx_40xx_MCI_Workspace *p = (T_LPC17xx_40xx_MCI_Workspace *)aWorkspace;

    // This implementation only supports 512 byte blocks!
    if (aBlockSize != 512)
        return UEZ_ERROR_INVALID_PARAMETER;

    // Determine how many blocks we are going to write (based on the
    // number requested to send and how much room we got).
    *aNumWriting = aNumBlocks;
    if (*aNumWriting >= NUM_MAX_BLOCKS)
        *aNumWriting = NUM_MAX_BLOCKS-1;
    p->iNumWriting = *aNumWriting;

    // Setup indexes
    p->iBufferPosOut = 0;
    p->iBufferPosIn = 0;
    p->iTransferStatus = TRANSFER_STATUS_WRITING;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_MCI_StartTransmission
 *---------------------------------------------------------------------------*
 * Description:
 *      Start writing blocks as they are written
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 *      TUInt32 aNumBlocks      -- Number of total blocks to write
 *      TUInt32 aBlockSize      -- Size of each block (only 512 supported)
 *      T_mciReceptionComplete aTranmissionCallback -- Routine to call
 *                                  when complete from interrupt.
 *      void *aTransmissionCallbackWorkspace -- Workspace for callback.
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_MCI_StartTransmission(
    void *aWorkspace,
    T_mciTransmissionComplete aTransmissionCallback,
    void *aTransmissionCallbackWorkspace)
{
    T_gpdmaRequest r;
    T_LPC17xx_40xx_MCI_Workspace *p = (T_LPC17xx_40xx_MCI_Workspace *)aWorkspace;

    // Set the callback routine (if any)
    p->iTransmissionCompleteCallback = aTransmissionCallback;
    p->iTransmissionCompleteCallbackWorkspace = aTransmissionCallbackWorkspace;

    // Load first LLI
    r.iSourcePeripheral = GPDMA_PERIPHERAL_MEMORY;
    r.iSourceAddr = G_linkListWrite[0][0];
    r.iDestinationPeripheral = GPDMA_PERIPHERAL_SD_MMC;
    r.iDestinationAddr = G_linkListWrite[0][1];
    r.iLinkedList = (void *)G_linkListWrite[0][2];
    r.iNumTransferItems = GPDMA_TRANSFER_SIZE(512 / 4);
    r.iFlowControl = GPDMA_FLOW_CONTROL_DESTINATION_PERIPHERAL; // Receiver should always be flow controller!
    r.iControl = /*GPDMA_INT_ENABLE | */GPDMA_SI | GPDMA_DBWIDTH_32
        | GPDMA_SBWIDTH_32 | GPDMA_SBSIZE_8 | GPDMA_DBSIZE_8;

