FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_MCI.c
    /* Transfer status: Memory --> MCI*/
    (*p->iGPDMA)->PrepareRequest(p->iGPDMA, &r, 0, 0);
    (*p->iGPDMA)->Start(p->iGPDMA);

    // Set total data length
    MCI_DATA_LEN = 512 * (p->iNumWriting+1);
    // Data timer: 0.2sec
    MCI_DATA_TMR = (TUInt32)(SDCARD_MCI_RATE_FOR_RW_STATE * 3.0); // TODO verify the new timeout, but we need to support multiple brands of cards
    // Clear status flags
    MCI_CLEAR = 0x51A;
    // DataBlockEnd StartBitErr DataEnd RxOverrun DataTimeOut DataCrcFail
    MCI_MASK0 = 0x51A;

    // Start to transmit data blocks (enable for DMA)
    MCI_DATA_CTRL = (9<<4) | 0x9;
    writeDelay();

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_MCI_StopTransfer
 *---------------------------------------------------------------------------*
 * Description:
 *      Halt any transfers possibly in progress regardless of state.
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_MCI_StopTransfer(void *aWorkspace)
{
    T_LPC17xx_40xx_MCI_Workspace *p = (T_LPC17xx_40xx_MCI_Workspace *)aWorkspace;

    /* Disable MCI interrupt */
    MCI_MASK0 = 0;

    /* Stop MCI data transfer */
    MCI_DATA_CTRL = 0;
    writeDelay();

    /* Disable DMA ch-0 */
    (*p->iGPDMA)->Stop(p->iGPDMA);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_MCI_Read
 *---------------------------------------------------------------------------*
 * Description:
 *      Read a block waiting to be received.  Currently only supports
 *      512 byte blocks.
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 *      void *aBuffer           -- Buffer to receive 512 byte block
 *      TUInt32 aReadSize       -- Size of block to read
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_MCI_Read(void *aWorkspace, void *aBuffer, TUInt32 aReadSize)
{
    T_LPC17xx_40xx_MCI_Workspace *p = (T_LPC17xx_40xx_MCI_Workspace *)aWorkspace;

    // This implementation only supports 512 byte blocks!
    if (aReadSize != 512)
        return UEZ_ERROR_INVALID_PARAMETER;

    // If an error has occurred, report this
    if (p->iTransferStatus & TRANSFER_STATUS_ANY_ERROR) {
        return UEZ_ERROR_READ_WRITE_ERROR;
    }

    // If there is no data (yet), report this
    if (p->iBufferPosOut == p->iBufferPosIn)
        return UEZ_ERROR_OUT_OF_DATA;
    
    if (( p->iLastMCIError & MCI_STATUS_TX_UNDERRUN) == MCI_STATUS_TX_UNDERRUN) {
        //SEGGER_RTT_WriteString(0, "RXUNDER!\n");
        //return UEZ_ERROR_READ_WRITE_ERROR; // Note that if we report error here it is for the last read not the current read!
    }

    // Copy over a block of data
    Copy_al2un(aBuffer, G_dmaBlocks[p->iBufferPosOut], aReadSize);

    /* Next buffer block */
    p->iBufferPosOut++;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_MCI_Write
 *---------------------------------------------------------------------------*
 * Description:
 *      Write a block of data to the MCI controller.
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 *      void *aBuffer           -- Data to write to controller
 *      TUInt32 aNumBytes       -- Number of bytes to write (usually 512)
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_MCI_Write(
    void *aWorkspace,
    const TUInt8 *aBuffer,
    TUInt32 aNumBytes)
{
    T_LPC17xx_40xx_MCI_Workspace *p = (T_LPC17xx_40xx_MCI_Workspace *)aWorkspace;

    // This implementation only supports 512 byte blocks!
    if (aNumBytes != 512)
        return UEZ_ERROR_INVALID_PARAMETER;

    // Is there room?
    if (p->iBufferPosIn >= p->iNumWriting)
        return UEZ_ERROR_OUT_OF_SPACE;

    // If an error has occurred, report this
    if (p->iTransferStatus & TRANSFER_STATUS_ANY_ERROR) {
        return UEZ_ERROR_READ_WRITE_ERROR;
    }
    
    if (( p->iLastMCIError & MCI_STATUS_TX_UNDERRUN) == MCI_STATUS_TX_UNDERRUN) {
        //SEGGER_RTT_WriteString(0, "TXUNDER!\n");
        //return UEZ_ERROR_READ_WRITE_ERROR; // Note that this is the last error, so we need to handle it somewhere else
    }

    // There is a block, write it
    Copy_al2un(G_dmaBlocks[p->iBufferPosIn], aBuffer, 512);

    /* Next DMA buffer */
    p->iBufferPosIn++;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_MCI_SetRelativeCardAddress
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the active RCA (Relative Card Address).
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 *      TUInt32 aRCA            -- Relative Card Address (RCA)
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_MCI_SetRelativeCardAddress(void *aWorkspace, TUInt32 aRCA)
{
    T_LPC17xx_40xx_MCI_Workspace *p = (T_LPC17xx_40xx_MCI_Workspace *)aWorkspace;
    p->iRCA = aRCA;
    
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_MCI_SetClockRate
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the clocking rate of the MCI bus clock in Hz.  If power save
 *      mode is set, the clock is only run when communications is active,
 *      otherwise it is run continuously.
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 *      TUInt32 aHz             -- Clock rate in Hz.
 *      TBool aPowerSave        -- ETrue to save power by running the clock
 *                                  only when active, else EFalse to run
 *                                  clock continuously.
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_MCI_SetClockRate(
    void *aWorkspace,
    TUInt32 aHz,
    TBool aPowerSave)
{
    TUInt32 clock;
    TUInt32 div;
    PARAM_NOT_USED(aWorkspace);

    // Power save means the clock ONLY runs when needed, otherwise the SD CLK
    // runs continously.
    if (aHz == 0) {
        LPC_MCI->CLOCK &= ~0x100;
        writeDelay();
    } else {
        clock = PCLK_FREQUENCY/2;
        div = 0;
        while ((clock / (div+1)) > aHz)
            div++;

          LPC_MCI->CLOCK = (LPC_MCI->CLOCK & 0x00000C00) | (1<<8)
              | (div)
              | (aPowerSave ? (1<<9) : 0);
          writeDelay();
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_MCI_SetDataBus
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the type of MCI bus active.  MCI device will initialize to
 *      1 bit bus.  Used to go into 4 bit parallel mode.
 * Inputs:
 *      void *aWorkspace        -- MCI Workspace
 *      T_uezMCIBus aBus        -- Type of bus (1-bit or 4-bit)
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_MCI_SetDataBus(void *aWorkspace, T_uezMCIBus aBus)
{
    switch (aBus) {
        case UEZ_MCI_BUS_4BIT_WIDE:
            LPC_MCI->CLOCK |= 0x800;
            writeDelay();
            break;
        case UEZ_MCI_BUS_1BIT_WIDE:
            LPC_MCI->CLOCK &= ~0x800;
            writeDelay();
            break;
        default:
            return UEZ_ERROR_INVALID_PARAMETER;
    }
    return UEZ_ERROR_NONE;
}

TBool LPC17xx_40xx_MCI_IsWriteAvailable(void *aWorkspace)
{
    T_LPC17xx_40xx_MCI_Workspace *p = (T_LPC17xx_40xx_MCI_Workspace *)aWorkspace;

    // Determine if there is room available.  If there is room, then ETrue
    if (p->iBufferPosIn < p->iNumWriting)
        return ETrue;

    return EFalse;
}

TBool LPC17xx_40xx_MCI_IsWriteEmpty(void *aWorkspace)
{
    T_LPC17xx_40xx_MCI_Workspace *p = (T_LPC17xx_40xx_MCI_Workspace *)aWorkspace;

    // Have all the blocks been written?  It not, then EFalse.
    if (p->iBufferPosOut < p->iNumWriting)
        return EFalse;

