FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_MCI.c
    return ETrue;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_MCI_SetErrorCallback
 *---------------------------------------------------------------------------*
 * Description:
 *      Start error callback
 * Inputs:
 *      void *aWorkspace          -- MCI Workspace
 *      T_mciError aErrorCallback -- Routine to call when error encountered.
 *      void *aErrorCallbackWorkspace -- Workspace for callback.
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_MCI_SetErrorCallback(
    void *aWorkspace,
    T_mciError aErrorCallback,
    void *aErrorCallbackWorkspace)
{
    T_LPC17xx_40xx_MCI_Workspace *p = (T_LPC17xx_40xx_MCI_Workspace *)aWorkspace;

    // Set the callback routine (if any)
    p->iErrorCallback = aErrorCallback;
    p->iErrorCallbackWorkspace = aErrorCallbackWorkspace;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Device Interface table:
 *---------------------------------------------------------------------------*/
const HAL_MCI LPC17xx_40xx_MCI_Interface = { {
    "LPC17xx_40xx:MCI",
    0x0204,
    LPC17xx_40xx_MCI_InitializeWorkspace,
    sizeof(T_LPC17xx_40xx_MCI_Workspace), },

// v2.04
    LPC17xx_40xx_MCI_PowerOn,
    LPC17xx_40xx_MCI_PowerOff,
    LPC17xx_40xx_MCI_Reset,
    LPC17xx_40xx_MCI_SendCommand,
    LPC17xx_40xx_MCI_ReadyReception,
    LPC17xx_40xx_MCI_StopTransfer,
    LPC17xx_40xx_MCI_Read,
    LPC17xx_40xx_MCI_SetRelativeCardAddress,
    LPC17xx_40xx_MCI_SetClockRate,
    LPC17xx_40xx_MCI_SetDataBus,
    LPC17xx_40xx_MCI_ReadyTransmission,
    LPC17xx_40xx_MCI_StartTransmission,
    LPC17xx_40xx_MCI_Write,
    LPC17xx_40xx_MCI_IsWriteAvailable,
    LPC17xx_40xx_MCI_IsWriteEmpty,

    // uEZ 2.11.1
    LPC17xx_40xx_MCI_SetErrorCallback,
};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC17xx_40xx_MCI_Require(const T_LPC17xx_40xx_MCI_Pins *aPins, const char *aGPDMA)
{
    T_halWorkspace *p_mci;
    T_LPC17xx_40xx_MCI_Workspace *p;

    static const T_LPC17xx_40xx_IOCON_ConfigList pinsDAT0[] = {
            {GPIO_P0_22, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_ENABLE, IOCON_INVERT_OFF, IOCON_SLEW_FAST, IOCON_PUSH_PULL)},
#if (UEZ_PROCESSOR == NXP_LPC1788)
            {GPIO_P1_6,  IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_ENABLE, IOCON_INVERT_OFF, IOCON_SLEW_FAST, IOCON_PUSH_PULL)},
#elif (UEZ_PROCESSOR == NXP_LPC4088)
            {GPIO_P1_6,  IOCON_W(2, IOCON_NO_PULL, IOCON_HYS_ENABLE, IOCON_INVERT_OFF, IOCON_DIGITAL, IOCON_FILTER_OFF, IOCON_SLEW_FAST, IOCON_PUSH_PULL)},
#endif
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList pinsDAT1[] = {
#if (UEZ_PROCESSOR == NXP_LPC1788)
            {GPIO_P1_7,  IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_ENABLE, IOCON_INVERT_OFF, IOCON_SLEW_FAST, IOCON_PUSH_PULL)},
#elif (UEZ_PROCESSOR == NXP_LPC4088)
            {GPIO_P1_7,  IOCON_W(2, IOCON_NO_PULL, IOCON_HYS_ENABLE, IOCON_INVERT_OFF, IOCON_DIGITAL, IOCON_FILTER_OFF, IOCON_SLEW_FAST, IOCON_PUSH_PULL)},
#endif
            {GPIO_P2_11, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_ENABLE, IOCON_INVERT_OFF, IOCON_SLEW_FAST, IOCON_PUSH_PULL)},
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList pinsDAT2[] = {
            {GPIO_P1_11, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_ENABLE, IOCON_INVERT_OFF, IOCON_SLEW_FAST, IOCON_PUSH_PULL)},
            {GPIO_P2_12, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_ENABLE, IOCON_INVERT_OFF, IOCON_SLEW_FAST, IOCON_PUSH_PULL)},
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList pinsDAT3[] = {
            {GPIO_P1_12, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_ENABLE, IOCON_INVERT_OFF, IOCON_SLEW_FAST, IOCON_PUSH_PULL)},
            {GPIO_P2_13, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_ENABLE, IOCON_INVERT_OFF, IOCON_SLEW_FAST, IOCON_PUSH_PULL)},
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList pinsCLK[] = {
            {GPIO_P0_19, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_ENABLE, IOCON_INVERT_OFF, IOCON_SLEW_FAST, IOCON_PUSH_PULL)},
            {GPIO_P1_2,  IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_ENABLE, IOCON_INVERT_OFF, IOCON_SLEW_FAST, IOCON_PUSH_PULL)},
    };
    static const T_LPC17xx_40xx_IOCON_ConfigList pinsCMD[] = {
            {GPIO_P0_20, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_ENABLE, IOCON_INVERT_OFF, IOCON_SLEW_FAST, IOCON_PUSH_PULL)},
            {GPIO_P1_3,  IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_ENABLE, IOCON_INVERT_OFF, IOCON_SLEW_FAST, IOCON_PUSH_PULL)},
    };

    HAL_DEVICE_REQUIRE_ONCE();

    LPC17xx_40xx_GPIO0_Require();
    LPC17xx_40xx_GPIO1_Require();
    LPC17xx_40xx_GPIO2_Require();

    // Register MCI Controller
    HALInterfaceRegister("MCI",
            (T_halInterface *)&LPC17xx_40xx_MCI_Interface, 0, &p_mci);
    p = (T_LPC17xx_40xx_MCI_Workspace *)p_mci;

    // Turn on the MCI Controller
    LPC17xx_40xxPowerOn(1<<28);

    // Lock GPIO pins, if any
    p->iCardDetect = aPins->iCardDetect;
    p->iWriteProtect = aPins->iWriteProtect;
    if (p->iCardDetect != GPIO_NONE)
        UEZGPIOLock(p->iCardDetect);
    if (p->iWriteProtect != GPIO_NONE)
        UEZGPIOLock(p->iWriteProtect);

    LPC17xx_40xx_IOCON_ConfigPin(aPins->iDAT0, pinsDAT0, ARRAY_COUNT(pinsDAT0));
    LPC17xx_40xx_IOCON_ConfigPin(aPins->iDAT1, pinsDAT1, ARRAY_COUNT(pinsDAT1));
    LPC17xx_40xx_IOCON_ConfigPin(aPins->iDAT2, pinsDAT2, ARRAY_COUNT(pinsDAT2));
    LPC17xx_40xx_IOCON_ConfigPin(aPins->iDAT3, pinsDAT3, ARRAY_COUNT(pinsDAT3));
    LPC17xx_40xx_IOCON_ConfigPin(aPins->iCLK, pinsCLK, ARRAY_COUNT(pinsCLK));
    LPC17xx_40xx_IOCON_ConfigPin(aPins->iCMD, pinsCMD, ARRAY_COUNT(pinsCMD));

    // Reset MCI Registers
    LPC_MCI->MASK0 = 0;
    LPC_MCI->COMMAND = 0;
    LPC_MCI->DATACTRL = 0;
    writeDelay();

    // Setup interrupt for the MCI
    InterruptRegister(MCI_IRQn, LPC17xx_40xx_MCI_Interrupt,
        INTERRUPT_PRIORITY_HIGHEST, "MCI");
    InterruptEnable(MCI_IRQn);



    // Find the GPDMA HAL driver
    HALInterfaceFind(aGPDMA, (T_halWorkspace **)&p->iGPDMA);

    if ((((TUInt32)&G_dmaBlocks) & 0xFFF00000) != 0x20000000) {
        // The G_dmaBlocks and G_linkList must be in AHB0 or AHB1 memory
        // at about 0x20000000 - 0x2007FFFF.  If it didn't get put there,
        // the code was not compiled correctly!
        UEZFailureMsg("MCI memory space error!");
    }
}

/*-------------------------------------------------------------------------*
 * End of File:  LPC17xx_40xx_MCI.c
 *-------------------------------------------------------------------------*/
